import { QuestionSet } from "./types";

export const STORAGE_KEY = 'arkan_tartys_data_v3';
export const WINNING_SCORE = 5;

export const DEFAULT_QUESTIONS: QuestionSet = {
  id: 'default-set',
  name: 'Жалпы сұрақтар (Мысал)',
  questions: [
      { id: '1', text: '1 байтта неше бит бар?', answer: '8' },
      { id: '2', text: 'Ақпаратты өңдейтін негізгі құрылғы?', answer: 'процессор' },
      { id: '3', text: 'Компьютердің "миы" қалай аталады?', answer: 'процессор' },
      { id: '4', text: 'Мәтіндік ақпаратты сақтайтын файл кеңейтілуі?', answer: 'txt' },
      { id: '5', text: 'Интернеттегі парақшаларды қарауға арналған бағдарлама?', answer: 'браузер' }
  ]
};

export const KEYBOARD_LAYOUTS = {
  en: [
      ['1','2','3','4','5','6','7','8','9','0'],
      ['Q','W','E','R','T','Y','U','I','O','P'],
      ['A','S','D','F','G','H','J','K','L'],
      ['Z','X','C','V','B','N','M']
  ],
  ru: [
      ['1','2','3','4','5','6','7','8','9','0'],
      ['Й','Ц','У','К','Е','Н','Г','Ш','Щ','З','Х','Ъ'],
      ['Ф','Ы','В','А','П','Р','О','Л','Д','Ж','Э'],
      ['Я','Ч','С','М','И','Т','Ь','Б','Ю']
  ],
  kz: [
      ['Ә','І','Ң','Ғ','Ү','Ұ','Қ','Ө','Һ'], 
      ['Й','Ц','У','К','Е','Н','Г','Ш','Щ','З','Х','Ъ'],
      ['Ф','Ы','В','А','П','Р','О','Л','Д','Ж','Э'],
      ['Я','Ч','С','М','И','Т','Ь','Б','Ю']
  ]
};